Revit 2027 API
BuiltInFailures.DPartFailures.DeletingDPartWillDeleteMorePartsError Property
 Deleting a Part will delete all associated Parts and the original Element will be made visible.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId DeletingDPartWillDeleteMorePartsError { get; }
Public Shared ReadOnly Property DeletingDPartWillDeleteMorePartsError As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ DeletingDPartWillDeleteMorePartsError {
	FailureDefinitionId^ get ();
}
static member DeletingDPartWillDeleteMorePartsError : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.DPartFailures Class
Autodesk.Revit.DB Namespace